{
    "id": "codewithharry",
    "name": "Haris Ali Khan",
    "displayName": "CodeWithHarry",
    "bio": "Haris Ali Khan, widely recognized as CodeWithHarry, stands as one of India's most beloved and influential programming educators, having simplified coding for millions of learners worldwide. As a software engineer, educator, and content creator with an extensive YouTube following, Harry has revolutionized the way programming is taught in India by creating practical, beginner-friendly tutorials that focus on building real-world coding skills. His teaching philosophy centers on making complex programming concepts accessible to everyone, regardless of their technical background. From Python fundamentals to advanced web development, data science, and machine learning, CodeWithHarry's comprehensive course library covers the entire spectrum of programming education, empowering countless students to kickstart their careers in technology.",
    "expertise": [
      "Python",
      "Web Development",
      "Data Science",
      "Machine Learning",
      "Programming Fundamentals"
    ],
    "experience": "8+ years",
    "studentsHelped": "4,000,000+",
    "specialization": "Full-Stack Development & Data Science Education",
    "teachingStyle": "Project-based learning with beginner-friendly explanations, emphasis on hands-on coding practice, and focus on real-world applications",
    "achievements": [
      "Recognized as the top educator and content creator in the Indian programming community with millions of followers",
      "Founded and built the CodeWithHarry YouTube channel into one of India's largest programming education resources",
      "Created multiple highly popular coding courses covering Python, Web Development, Data Science, and Machine Learning",
      "Known worldwide for simplifying complex programming topics into clear, step-by-step tutorials that anyone can follow",
      "Helped millions of students learn programming and build successful careers in technology"
    ],
    "image": "https://yt3.googleusercontent.com/ytc/AIdro_kX3sdbuu3KFmRPsmlu0R5Rx_BhpxwupjtvJmkEdNfla7w=s900-c-k-c0x00ffffff-no-rj",
    "socialLinks": {
      "youtube": "https://www.youtube.com/@CodeWithHarry",
      "website": "https://www.codewithharry.com",
      "linkedin": "https://www.linkedin.com/in/codewithharry/",
      "github": "https://github.com/CodeWithHarry"
    }
  }
  